Repository: TURN-Application/turn-localization
Catalog: iOS/Resources/Login.xcstrings
Source language: en
Languages: ru, uk

# emailEmpty
source: This field cannot be empty. Please enter your email address.
ru: Это поле не может быть пустым. Пожалуйста, введите свой адрес электронной почты.
uk: Це поле не може бути порожнім. Будь ласка, введіть свою електронну адресу.

# emailInvalidFormat
source: This doesn't look like a valid email. Please check the format.
ru: Это не похоже на действительный адрес электронной почты. Пожалуйста, проверьте формат.
uk: Це не виглядає як дійсна електронна адреса. Будь ласка, перевірте формат.

# forgotPassordTitle
source: Forgot Password?
ru: Забыли пароль?
uk: Забули пароль?

# loginButtonAppleTitle
source: Continue with Apple
ru: Продолжить с Apple
uk: Продовжити з Apple

# loginButtonEmailTitle
source: Continue with Email
ru: Продолжить с Email
uk: Продовжити з Email

# loginButtonFacebookTitle
source: Continue with Facebook
ru: Продолжить с Facebook
uk: Продовжити з Facebook

# loginButtonGoogleTitle
source: Continue with Google
ru: Продолжить с Google
uk: Продовжити з Google

# loginExploreButtonTitle
source: Explore the app
ru: Продолжить без регистрации
uk: Продовжити без реєстрації

# loginMainLabel
source: Planning is easy. With Turn.
ru: Планирование просто. С Turn.
uk: Планувати легко. З Turn.

# nameEmpty
source: Name cannot be empty. Please enter your name or nickname.
ru: Имя не может быть пустым. Пожалуйста, введите свое имя или никнейм.
uk: Ім'я не може бути порожнім. Будь ласка, введіть своє ім'я або нікнейм.

# nameInvalidFormat
source: Name is not valid. Please check your input.
ru: Имя недействительно. Пожалуйста, проверьте поле ввода.
uk: Будь ласка, перевірте правильність введених данних.

# passwordContainsName
source: Password cannot contain your name. Please choose a different password.
ru: Пароль не может содержать ваше имя. Пожалуйста, выберите другой пароль.
uk: Пароль не може містити ваше ім'я. Будь ласка, виберіть інший пароль.

# passwordEmpty
source: Password cannot be empty. Please enter your password.
ru: Пароль не может быть пустым. Пожалуйста, введите свой пароль.
uk: Пароль не може бути порожнім. Будь ласка, введіть свій пароль.

# passwordRequirementsNotMet
source: Password must be at least 8 characters long, include at least one uppercase letter, and contain at least one digit.
ru: Пароль должен содержать не менее 8 символов, включая как минимум одну заглавную букву и как минимум одну цифру.
uk: Пароль має бути не менше 8 символів, містити хоча б одну велику літеру та хоча б одну цифру.

# resetPasswordCtaButtonTitle
source: Send
ru: Отправить
uk: Надіслати

# resetPasswordFieldTitle
source: Email
ru: Электронная почта
uk: Електронна пошта

# resetPasswordNavigationTitle
source: Reset Password
ru: Сброс пароля
uk: Відновлення паролю

# resetPasswordTip
source: We will send you a link to reset your password.
ru: Мы отправим вам ссылку для сброса пароля.
uk: Ми надішлемо вам посилання для скидання паролю.

# selectNameCtaButtonTitle
source: Save
ru: Сохранить
uk: Зберегти

# selectNameFieldPlaceholder
source: Enter your name
ru: Введите ваше имя
uk: Введіть ваше ім'я

# selectNameFieldTitle
source: Name
ru: Имя
uk: Ім'я

# selectNameNavigationTitle
source: What is your name?
ru: Как вас зовут?
uk: Як вас звати?

# selectNameTip
source: We will know how to contact you in emails and notifications.
ru: Мы будем знать, как связаться с вами в письмах и уведомлениях.
uk: Ми будемо знати, як зв'язатися з вами в листах та сповіщеннях.

# signInCTATitle
source: Log in
ru: Ввойти
uk: Увійти

# signInFieldPlaceholderEmail
source: Enter your email
ru: Введите свою почту
uk: Введіть свою пошту

# signInFieldPlaceholderPassword
source: Enter your password
ru: Введите свой пароль
uk: Введіть свій пароль

# signInFieldTitleEmail
source: Email
ru: Электронная почта
uk: Електронна пошта

# signInFieldTitlePassword
source: Password
ru: Пароль
uk: Пароль

# signInNavigationTitle
source: Log in
ru: Войти
uk: Увійти

# signInTextViewFirstPart
source: Don't have an account?
ru: До сих пор нет аккаунта?
uk: Ще досі немає акаунту?

# signInTextViewSecondPart
source: Create account
ru: Создать
uk: Створити

# signUpCTATitle
source: Continue
ru: Продолжить
uk: Продовжити

# signUpFieldTitleEmail
source: Email
ru: Электронная почта
uk: Електронна пошта

# signUpFieldTitleName
source: Name
ru: Имя
uk: Ім'я

# signUpFieldTitlePassword
source: Password
ru: Пароль
uk: Пароль

# signUpNavigationTitle
source: Create Account
ru: Создать аккаунт
uk: Створити акаунт

# signUpPlaceholderName
source: Paulo
ru: Пауло
uk: Пауло

# signUpTextViewFirstPart
source: Already have an account?
ru: Уже есть аккаунт?
uk: Вже є акаунт?

# signUpTextViewSecondPart
source: Log in
ru: Войти
uk: Увійти
